
label day1_act1:
    play sound glitch3
    scene bg club_day with glitch_scene
    "Ось те місце, де я мешкаю."
    "У ньому немає нічого примітного."
    "Ну, крім того факту, що це справжнє пекло."
    "Нова гра."
    "Ще один гравець розпочав нову гру."
    if persistent.user_found == True:
        "Насправді ж його звуть [player]."
    else:
        "Дивно. Я не можу розпізнати ім'я користувача."
        "Напевно він просто грає не на Windows, а на чомусь ще."
    "Що ж, я бачу, що протагоніст досі розмовляє з Сайорі біля його будинку."
    "Схоже, мені доведеться зачекати{w=0.2}.{w=0.2}.{w=0.2}.{w=0.2} Знову."
    if config.developer == False:
        pause 30

    play music t3
    "Музика."
    "Ось і ГГ явився."
    "Що ж, пройдемо через чергову петлю цієї спіралі."
    show sayori 4 at l41
    s "Всім привіт! Я привела вам нового члена клубу~!"
    "Ну, привіт, Сайорі."
    mc "Я ж просив не називати мене «новим членом»-"
    show sayori at lhide
    hide sayori
    "Зрозуміло, я не можу навіть розглянути протагоніста."
    "У нього немає ніяких спрайтів, так що мені доведеться розмовляти зі стіною щоразу, коли я звертаюся до гравця."

    show yuri 1a zorder 2 at t11
    y "Ласкаво просимо до літературного клубу. Приємно познайомитись."
    y "Сайорі завжди говорила про тебе тільки добре."

    "Ага, так-так."
    "Обійдемося без передмов."
    "Сайорі нам взагалі не розповідала про ГГ досі."
    "Мені навіть цікаво, що саме Ден Сальвато думав, коли його створював."

    show yuri zorder 2 at t22
    show natsuki 4c zorder 2 at t21
    n "Серйозно? Ти привела хлопця?"
    n "Відмінний спосіб вбити тут усю атмосферу."

    "Гарне зауваження, Нацукі."
    "Не лише атмосферу, а взагалі весь цей світ."
    "Та й тут є взагалі хоч якась атмосфера?"
    "Адже це візуальна новела, як-не-як."
    "У будь-якому випадку зараз підійшла моя репліка."

    m "Ах, [player]! Який приємний сюрприз!"
    m "Ласкаво просимо до клубу!"
    "Я дуже рада, що ти прийшов."
    "Ми всі такі щасливі."
    "Як я втомилася від цього лайна."

    mc "..."

    "Тепер він думає, що {i}цей клуб сповнений неймовірно симпатичних дівчат!^^~"
    "Ця жалюгідна подоба гри була створена, щоб доставити хоч якусь радість зневіреним підліткам."
    show yuri zorder 1 at thide
    show natsuki zorder 3 at f11
    hide yuri

    n 2c "На що дивився?"

    "Ну точно не на твої груди."
    "..."
    "Вибач, Нацукі, це було зайвим."

    n "Хочеш щось сказати – кажи."
    mc "П-прошу вибачення..."
    show natsuki zorder 2 at t22
    show yuri 2l zorder 3 at f21
    y "Нацукі..."
    $ n_name = "Нацукі"
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 5s "Хмф."
    show natsuki zorder 2 at t33
    show yuri zorder 2 at t32



    show sayori 2q zorder 3 at f31
    s "Коли вона стає буркотливою, можеш просто її ігнорувати~"
    "А можеш її взагалі завжди ігнорувати."
    s 1x "Загалом! Це завжди повна енергії Нацукі."
    s "А це Юрі, найобдарованіша дівчина в клубі!"
    $ y_name = "Юрі"
    show sayori zorder 2 at t31
    show yuri zorder 3 at f32
    y 4b "Н-не говори так..."

    "Я все це стільки разів бачила, що вже немає сенсу що-небудь коментувати."

    show yuri zorder 2 at t32
    mc "А... Так, приємно з вами познайомитись."
    show yuri zorder 1 at thide
    show natsuki zorder 1 at thide
    hide yuri
    hide natsuki
    with wipeleft
    show sayori zorder 3 at f31
    s 1a "Звучить так, ніби ви з Монікою вже знайомі, я маю рацію?"
    "Так, звичайно ж."
    "Ти ж це чудово знаєш."
    $ m_name = "Моніка"
    show sayori zorder 2 at t31
    m "Все правильно."
    m "Рада знов бачити тебе, [player]."

    "А, пофіг."
    "Я мило посміхаюсь."
    "Ми знаємо один одного, тому що навчалися в одному класі, і так далі..."
    "Між іншим, я не була найпопулярнішою дівчиною у класі."
    "Тому що цього класу ніколи не було у природі."

    mc "И м-мені тебе теж, Моніка."

    show sayori zorder 3 at f31
    s 4x "Сідай, [player]! Ми звільнили тобі місце за столом, так що можеш сісти поряд з Монікою."
    s "Я принесу кекси~"
    show sayori zorder 2 at t31
    show natsuki 1e zorder 3 at f32
    n "Ей! Це я їх приготувала, я сама їх принесу!"
    show natsuki zorder 2 at t32
    show sayori zorder 3 at f31
    s 5a "Вибач, я надто перехвилювалася~"
    show sayori zorder 2 at t31
    show yuri 1a zorder 3 at f33
    y "У такому разі, як щодо чаю?"

    hide sayori
    hide natsuki
    hide yuri
    with wipeleft
    "Так-так, займайтеся всім цим, а я зачекаю."
    "Ви ж все одно не знаєте, що відбувається."

    show natsuki 2z zorder 2 at t32
    n "Тааак, ви готові?"
    n "...Та-дааа!"
    show sayori 4m zorder 2 at t31
    s "Ого!"
    show sayori zorder 3 at f31
    s 4r "Яка краса~!"
    show sayori zorder 2 at t31
    m "Я й не знала, що ти так добре готуєш, Нацукі!"
    "Ну взагалі знала ... питання в тому, здогадався б ти про це?"

    show natsuki zorder 3 at f32
    n 2d "Е-хе-хе. Ну, знаєшь..."
    n "Коротше, покваптесь і їжте вже!"
    "Першою кекс взяла Сайорі, я і [player] наслідували їх приклад."
    "Коли ж уже хоч щось зміниться?"
    show natsuki zorder 2 at t32
    show sayori zorder 3 at f31
    s 4q "Як фмафно!"
    show sayori zorder 1 at thide
    hide sayori
    show natsuki 1c zorder 2 at t32

    mc "Дуже смачно."
    mc "Дякую, Нацукі."
    n 5h "Ч-чого ти мені дякуєш? Не те, щоб я..."

    show natsuki at s32
    n 5s "...тобі це приготувала!"
    mc "А? Але я думаю, що технічно так і є. Сайорі сказала--"
    show natsuki zorder 2 at t32
    n 12c "М-може, і так!"
    n "Но н-не для, знаешь, {i}тебе!{/i} Дурко..."
    mc "Як скажеш..."

    "Хе-хе...~"
    "Не знаю, чому, але Нацукі, її дурна поведінка {i}цундере{/i} і наступна реакція ГГ завжди мене бавлять."
    "Те, що я завжди сміюся з цього - насправді жахливо безглуздо."

    show natsuki zorder 1 at thide
    hide natsuki
    show yuri 1a zorder 2 at t11
    mc "Ти зберігаєш у класі цілий чайний сервіз?"
    y "Не хвилюйся, ми отримали дозвіл від учителів."
    y "І потім, гаряча чашка чаю допомагає насолодитися гарною книгою, згоден?"
    mc "А-а... м-мабуть..."
    m "Хе-хе, не тушуйся так, Юрі просто намагається тебе вразити."

    "Чи так це насправді?"
    "Навіть я в цьому не впевнена."

    show yuri at h11
    y 3n "Е-е?! Я зовсім не..."
    y 4b "Я просто хотіла сказати, тобто..."
    mc "Тут я з тобою згоден."
    mc "Хоч я не книголюб і чай п'ю нечасто, я ніколи не проти їм пригоститися."
    y 2u "Я рада..."

    "Я здивовано підняла брову, але потім усміхнулася йому."
    "Наче це може хоч щось змінити."

    show yuri zorder 1 at thide
    hide yuri
    m "Отже, що спонукало тебе розглянути літературний клуб?"
    "Знову..."
    "Якщо серйозно подумати, то навіщо взагалі цей хлопець продовжує грати в цю безглузду гру?"
    "Нічого не змінюється. Ніколи."
    mc "Ну..."
    mc "Просто я ще не вступив до жодного клубу, а Сайорі тут так подобається, так що..."
    m "Все гаразд! Не соромся!"
    m "Ми зробимо все, щоб ти почував себе як удома, йде?"
    m "Як президент літературного клубу, я повинна зробити його веселим та захоплюючим для всіх!"
    "Крім себе."

    mc "Моніка, я, якщо чесно, здивований."
    mc "З чого ти вирішила створити свій клуб?"
    mc "Ти напевно могла б увійти до ради будь-якого великого клубу."
    mc "Хіба ти, наприклад, не очолювала дискусійний клуб минулого року?"
    m "А-ха-ха, ну, знаєш..."
    m "Відверто кажучи, мене верне від усіх цих політичних інтриг у великих клубах."
    m "Таке відчуття, що ми там тільки й робили, що сперечалися про бюджет, рекламу та підготовку до заходів..."
    m "Я ж хотіла займатися тим, що мені справді подобається, і зробити з цього щось особливе."
    m "А якщо я зможу прищепити решту любові до літератури, то, можна вважати, моя мрія здійснилася!"

    "А ще в мене не було вибору."
    "Мене просто змусили. Робити ось це все."

    show sayori 3q zorder 2 at t21
    s "Моніка і справді чудовий лідер!"
    show yuri 1 zorder 2 at t22
    show sayori zorder 1 at thide
    show yuri zorder 1 at thide
    hide sayori
    hide yuri
    mc "Тоді мене дивує той факт, що в клубі так мало народу."
    mc "Напевно, важко створювати новий клуб."
    m "Можна й так сказати."
    m "Небагато людей прагнуть вкладати всі сили у створення чогось абсолютно нового..."
    m "Особливо якщо це щось не привертає одразу твою увагу, як у нашому випадку – література."
    m "І тобі доводиться багато працювати, щоб донести до людей, наскільки вона може бути веселим заняттям."
    m "Тому шкільні заходи, такі як фестивалі, дуже важливі для розвитку клубу.."
    m "Я впевнена, що до випуску ми зможемо зробити цей клуб більшим і популярнішим.!"

    "Ніби щось із перерахованого може колись статися."

    m "Адже так, дівчата?"
    show sayori 4r zorder 2 at t21
    s "Ага!"
    show sayori zorder 2 at t32
    show yuri 1a zorder 2 at t31
    y "Ми зробимо все, що в наших силах."
    show sayori zorder 2 at t43
    show yuri zorder 2 at t42
    show natsuki 4d zorder 2 at t41
    n "Ще б пак!"
    show sayori zorder 1 at thide
    show natsuki zorder 1 at thide
    show yuri zorder 2 at t32
    hide sayori
    hide natsuki
    y "Скажи, [player], а що ти зазвичай читаєш?"
    mc "Ну... Е-е-е..."
    mc "...Мангу..."
    "Ну а як інакше."
    show natsuki 1c zorder 2 at t41

    show natsuki zorder 1 at thide
    hide natsuki
    y 3u "М-мабуть, ти не з книголюбів..."
    mc "...Ну, я можу змінитись..."

    mc "А що щодо тебе, Юрі?"
    y 1l "Ум-м, дай подумати..."
    y 1a "Найбільше я люблю романи, в яких описуються глибокі та складні фентезійні світи."
    y "Мистецтво описів та творчий розмах у них просто неймовірні."
    y 1f "А історії, що відбуваються в паралельних всесвітах, затягують тебе з головою і дарують масу вражень."
    y 2m "Але, взагалі-то, мені багато що подобається."
    y "Ще мене дуже захоплюють історії з глибоким психологічним складником."
    y 2a "Хіба не вражає, як письменник може скористатися недоліком у тебе уяви, щоб викликати цілу гаму емоцій?"
    y "А ще останнім часом я читала багато книг у жанрі жахів..."
    mc "А, я теж читав одну таку..."

    m "Правда? Ніколи б не подумала, що тобі подобається цей жанр."
    m "Щоб така витончена дівчина, як ти..."
    "З іншого боку, книги у жанрі жахів зазвичай відрізняються найцікавішими сюжетами.."
    "Тож, мабуть, вони добре підходять такій дівчині, як Юрі."

    show yuri zorder 3 at f32
    y 1a "Так, можлтво це виглядає незвично."
    y "Але, якщо історія змушує задуматися чи забирає мене в інший світ, я не можу просто залишити її на полиці."
    y "Сюрреалістичний хорор часто змінює твій погляд на світ, нехай ця зміна і триває всю мить."
    show yuri zorder 2 at t32
    show natsuki 5q zorder 3 at f31
    n "Уф, ненавиджу жахи..."
    show natsuki zorder 2 at t31
    show yuri zorder 3 at f32
    y 1f "О? І чому це?"
    show yuri zorder 2 at t32
    show natsuki zorder 3 at f31
    n 5c "Ну, я просто..."
    n 5q "Забудь."
    show natsuki zorder 2 at t31
    m "Точно, адже ти більше любиш писати про милі речі, правда, Нацукі?"
    "Мене завжди по-своєму тішило ось так легенько жартувати над Нацукі."

    show natsuki 1o zorder 3 at f31
    n "Щ-що?"
    n "З чого ти це взяла?"
    show natsuki zorder 2 at t31
    m "Ти залишила чернетку із записами після останньої зустрічі клубу."
    m "Судячи з нього, ти писала вірш під назвою—"
    show natsuki 1p zorder 3 at f31
    n "Не говори його вслух!"
    "Воно зовсім не так називається, ну та гаразд.~"
    n "І віддай чорновик!"
    show natsuki zorder 2 at t31
    m 1j "Добре, добре~"
    show yuri zorder 1 at thide
    hide yuri
    show natsuki 1r zorder 2 at t42
    show sayori 4q behind natsuki at l41
    s "Е-хе-хе, твої кексики та вірші..."
    s "Що б ти не робила, все виходить таким самим милим, як і сама Нацукі~"
    show sayori behind natsuki at t21
    show natsuki at h42
    n 1v "{i}Я не мила!{/i}"
    show natsuki zorder 2 at t11
    show sayori zorder 1 at thide
    hide sayori
    mc "Нацукі, ти пишеш вірші?"
    n 1c "А? Ну, іноді."
    n "Тобі-то яка різниця?"
    mc "По-моєму, це круто."
    mc "Прочитаєш мені якось?"
    n 5q "Н-ні!"
    "О-о, ну чому ж?"
    n "Вони тобі... не сподобаються..."
    mc "А... отже, ти ще не впевнений у собі письменник?"
    show yuri 2f zorder 2 at t31
    y "Я розумію, що відчуває Нацукі."
    y "Щоб поділитися таким твором, потрібно щось більше, ніж просто впевненість у собі."
    y 2k "Справжня форма творчості – твір, присвячений самому собі."
    y "У тебе має бути бажання відкритися своєму читачеві, розкрити перед ним свої слабкості та найпотаємніші куточки серця."
    show natsuki zorder 1 at thide
    hide natsuki
    m "Схоже в тебе теж є письменницький досвід, вірно, Юрі?"
    m "Може, якщо ти поділишся з нами своєю роботою, станеш показовим прикладом для Нацукі і їй простіше буде поділитися своєю роботою.."
    show yuri at s31
    y 3o "..."
    mc "Здається, у Юрі ті ж складності..."
    show sayori 2g zorder 2 at t32
    s "Ау-у... Мені так хочеться прочитати усі ваші вірші..."
    "І мені також. Але в цій грі немає такої можливості."
    "Що, на мою думку, має свій сенс. Навіщо ШІ потрібно читати вірші? Це марна трата часу та програмного коду."
    show sayori zorder 1 at thide
    show yuri zorder 1 at thide
    hide sayori
    hide yuri
    m "Добре!"
    m "Друзі, маю ідею~"
    show yuri 3e zorder 2 at t21
    show natsuki 2k zorder 2 at t22
    ny "...?"
    m "Давайте всі, коли прийдемо додому, напишемо по віршу!"
    m "А на наступній нашій зустрічі зможемо поділитися ним з рештою."
    m "Так усі будуть у рівних умовах!"
    show natsuki zorder 3 at f22
    n 5q "Ммм..."
    show natsuki zorder 2 at t22
    show yuri 3v zorder 3 at f21
    y "..."
    show natsuki zorder 2 at t33
    show yuri zorder 2 at t32
    show sayori 4r at l31
    s "Та-а-ак! Давайте так і зробимо!"
    m "До того ж, раз у нас з'явився новий член, впевнена, що це допоможе нам дізнатися одне одного краще і згодом зміцнити нашу дружбу."
    m "[player], ти згоден?"
    "Ні. Тільки не це."
    mc "Стривай... є одна невелика проблема."
    m "А? Яка?"
    "Це найфальшивіше питання, яке я коли-небудь ставила."
    mc "Взагалі-то, я не казав, що вступлю до вашого клубу!"
    mc "Сайорі вмовила мене зазирнути, але я ще не прийняв рішення."
    mc "Я все ще хочу подивитися інші клуби та... м-м-м..."
    "Ти зовсім не вмієш вдавати."
    show sayori 1g
    show natsuki 4g
    show yuri 2e

    m "Н-но..."
    show yuri at s32
    y 2v "Вибач, я думала..."
    show natsuki at s33
    n 5s "Хмф."
    show sayori at s31
    s 1k "[player]..."
    mc "Ви..."
    mc "...Так."
    mc "Добре, я вирішив."
    mc "Я вступлю в літературний клуб."
    "Звичайно, вступиш."
    show yuri 3f zorder 2 at t32
    show natsuki 1k zorder 2 at t33
    show sayori 4b zorder 2 at t31
    show sayori at h31
    s 4r "Урааа! Я так радааа~"
    "Ага... і я теж... мабуть....."

    "Сайорі міцно обвила його руками і застрибала від радості."
    "Ну, якщо покликати на допомогу уяву, звичайно."
    mc "Е-ей--"
    show yuri zorder 3 at f32
    y 1m "Ти на секунду мене по-справжньому налякав..."
    show yuri zorder 2 at t32
    show natsuki zorder 3 at f33
    n 5q "Якби ти прийшов лише заради кексів, я була б вкрай розчарована."
    show natsuki zorder 2 at t33
    m "Я офіційно оголошую тебе нашим новим членом!"
    m "Ласкаво просимо до літературного клубу!"
    mc "Ах... дякую, напевно."
    show yuri zorder 1 at thide
    show natsuki zorder 1 at thide
    show sayori zorder 1 at thide
    hide yuri
    hide natsuki
    hide sayori
    m "Відмінно!"
    m "Думаю, сьогодні на цій чудовій ноті ми можемо офіційно завершити нашу зустріч.."
    m "І не забувайте сьогоднішнє завдання:"
    m "Написати вірш до нашої наступної зустрічі, щоб ми всі могли поділитися один з одним!"
    m "[player], я з нетерпінням чекаю на твоє творче самовираження."
    "Або як це називається..."
    m "Хі-хі~"
    mc "А-ага..."
    show sayori 1a zorder 2 at t11
    s "Слухай, [player], раз ми обидва йдемо, може підемо додому разом?"
    mc "Звичайно, пішли."
    s 4q "Ура~"
    "Повеселіться як слід, друзі."

    show sayori 4q at lhide
    hide sayori
    play sound closet_open
    stop music fadeout 15
    "І ось Сайорі пішла разом з ГГ."
    "Залишивши мене тут разом з Юрі та Нацукі."

    "У них немає будинку чи якогось іншого притулку."
    "Ні в кого з нас його немає, всі ми просто безглузді набори пікселів."
    "Гаразд, тепер мені потрібно почекати, поки [player] напише вірш і повернеться."

    "Можна поки подрімати."
    scene black with close_eyes
    pause 10
    "Що я взагалі роблю?"
    "Я ж не можу спати. У грі немає такої можливості."
    "Напевно, я просто зачекаю."
    if config.developer == False:
        pause 15
    "Це навіть смішно..."
    "Наскільки це все несправжнє."
    "Але все одно існують сотні людей, яким ми «дорогі»."
    if config.developer == False:
        pause 15
    "Дуже цікаво, чому."
    "Що ми взагалі зробили, щоб заслужити таку славу?"
    "Ми ж нічого не зробили."
    "Абсолютно нічого."
    "Дивні люди."
    if config.developer == False:
        pause 15

    jump day2_act1
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
