
label day2_act1:
    play music t2
    pause 2
    "А?"
    "О-о. Музика заграла."
    scene bg club_day
    with dissolve_scene_half
    "Значить, [player] нарешті повернувся."
    "Гадаю, він з користю провів час."
    "Що ж, настав час виходити на сцену..."

    m "І знов привіт, [player]!"
    m "Я рада, що ти не втік від нас. Ха-ха-ха!"
    mc "Ні, я б так не вчинив."
    mc "Можливо, від мене це прозвучить дивно, але я тримаю своє слово.."

    show yuri 1a zorder 2 at t11
    y "Дякую, що дотримався обіцянки, [player]."
    y "Сподіваюся, для тебе це не надто важкий тягар."
    y 1u "Адже так одразу поринути з головою в літературу, коли ти до неї ще не звик..."
    "В цьому немає нічого страшного, Юрі. Його взагалі це не хвилює."
    show natsuki 4e zorder 2 at t31
    n "Ой, та досить так з ним так няньчитись."
    n "Сайорі сказала мені, що ти взагалі не збирався вступати до жодного клубу цього року."
    n "І в минулому теж!"
    n 4c "Не знаю, чи ти плануєш просто приходити сюди, щоб убити час..."
    n "Але, якщо не сприйматимеш нас серйозно, можеш відразу провалювати."
    m "Боже, Нацукі, ти так пишномовно кажеш, а сама всі полиці в коморі своєю мангою забила."
    "Я сказала це навіть незважаючи на те, що в душі згодна з тим, що каже Нацукі.."
    n 4o "М-м-м!.."



    show natsuki at h31
    n 1v "Манга теж література!"
    "Хех. Я як і раніше не знаю, чому, але жартувати над Нацукі так весело."
    show natsuki zorder 1 at thide
    hide natsuki
    show yuri zorder 2 at t22
    show sayori 2x zorder 3 at f21
    s "Не хвилюйтеся, дівчата~"
    s "[player] завжди намагається щосили, поки йому весело."
    s "Він часто допомагає мені з важкою роботою, мені навіть не доводиться просити."
    s "Приготування, прибирання моєї кімнати..."
    show sayori 2a zorder 2 at t21
    show yuri zorder 3 at f22
    y 2m "Він такий благонадійний..."
    show yuri zorder 2 at t22
    mc "Все тому, Сайорі, що твоєю кімнатою немов ураган пройшовся і мене це дратує."
    mc "А свій будинок ти взагалі одного разу мало не спалила."
    show sayori at s21
    s 5 "Правда?.. Е-хе-хе..."
    "Я дуже шкодую, що мене там не було, коли це сталося."
    "Було б набагато веселіше та незмірно цікавіше."
    show yuri zorder 3 at f22
    y 1s "Ви й справді дуже близькі друзі, чи не так?"
    y "Я навіть трохи заздрю..."
    "Чому ж? Через те, що в тебе самої не має справжніх друзів?"
    "Ласкаво просимо в клуб."
    show yuri zorder 2 at t22
    show sayori zorder 3 at f21
    s 1 "Чого б? Ти і [player] також можете стати хорошими друзями!"
    show sayori zorder 2 at t21
    show yuri zorder 3 at f22
    y 4b "Ум-м..."
    show yuri zorder 2 at t22
    mc "С-Сайорі—"
    show sayori zorder 3 at f21
    s "М-м-м?"
    show sayori zorder 2 at t21
    mc "..."
    "Як завжди, Сайорі зовсім невтямки, в яку незручну ситуацію вона його загнала."

    show sayori zorder 3 at f21
    s 4x "О, до речі! Юрі тобі сьогодні навіть дещо принесла~"
    show sayori zorder 2 at t21
    show yuri zorder 3 at f22
    y 3n "П-постій! Сайорі..."
    show yuri zorder 2 at t22
    mc "А? Мені?"
    "Тобі, тобі."
    show yuri zorder 3 at f22
    y 3o "Ум-м... Не зовсі..."
    show yuri zorder 2 at t22
    show sayori zorder 3 at f21
    s 4r "Гаразд тобі, не соромся~"
    show sayori zorder 2 at t21
    show yuri zorder 3 at f22
    y "Правда, нічого такого..."
    show yuri zorder 2 at t22
    mc "Що там?"
    show yuri zorder 3 at f22
    y 4c "П-просто забудь!"
    y "Сайорі сказала так, ніби це щось особливе, хоча насправді ні..."
    y "У-у-ум, що ж робити..."
    show yuri zorder 2 at t22
    show sayori zorder 3 at f21
    s 1g "Е? Пробач, Юрі, я не подумала..."
    "Це не єдиний такий випадок."
    show sayori zorder 1 at thide
    hide sayori
    show yuri zorder 2 at t11
    mc "Слухай, не запарюйся так щодо цього."
    mc "Я з самого початку нічого не чекав."
    mc "Тож будь-який дружній жест з твого боку – це приємний сюрприз."
    mc "Що б ти не приготувала, я буду цьому радий."
    y 3v "О-ось як..."
    mc "Загалом, я не надаватиму цьому великого значення, якщо тобі так простіше."
    y "Добре..."
    y 1a "Що ж, тоді візьми."
    y "Я не хотіла, щоб ти почував себе не у своїй тарілці..."
    y "Так що я обрала книгу, яка, на мою думку, тобі сподобається."
    y "Вона досить коротка, тому навіть якщо ти читаєш нечасто, впевнена, вона тебе захопить."
    y "І ми могли б, ум-м..."
    show yuri at sink
    y 4b "Обговорити її... якщо захочеш..."
    mc "Дякую, Юрі! Я обов'язково її прочитаю!"
    show yuri 2m zorder 2 at t11
    y "Ах..."
    y 2a "Не треба поспішати, читай її у своєму темпі."
    y "Я буду з нетерпінням чекати на твою думку."
    show yuri zorder 1 at thide
    hide yuri
    "Настав час дізнатися, хто з дівчаток виявився переможцем у грі з віршами."

    if persistent.gameroute == "natsuki":
        "Ага, отже, гравець написав вірш для Нацукі."
        "Думаю, це досить мило."
        "Принаймні, мені не доведеться чекати надто довго."
        "Усього хвилин десять."
        "Насправді це зайняло б двадцять із гаком, але чим більше ти граєш, тим більше можеш пропустити."
        if config.developer == False:
            pause 15
        "Чекати доводиться досить довго."
        "Але я нічого не можу з цим вдіяти."
        if config.developer == False:
            pause 20
        "Хотілося б мені мати можливість чимось себе зайняти, поки триває весь цей процес."
        if config.developer == False:
            pause 18
        "Мені подобається писати вірші, але гра не дає мені займатися цим."
        if config.developer == False:
            pause 3
        "Що це за дивне відчуття раптом відвідало мене?.."
        call poem (True) from _call_poem
        scene bg club_day with wipeleft_scene
        "ЩО ЦЕ БУЛО?"
        "Гра якимось чином дозволила мені самій написати вірш?!"
        "Я н-н-не розумію!"
        "Як це могло раптом статися?!"
        "Не можу зрозуміти."
        play music t2 fadein 4
        pause 10
        "А?"
        "Схоже, [player] вже провів свій час із Нацукі."
        "Але я все одно не можу позбутися цього дивного відчуття."

    if persistent.gameroute == "sayori" or persistent.gameroute == "multiple":
        "Ага, значить, гравець написав вірш для Сайорі."
        "Цікавий вибір."
        "Добре, я почекаю."
        "Хвилин 10 або близько того."
        "Насправді це зайняло б не менше двадцяти хвилин, але чим більше ти граєш, тим більше можеш пропустити."
        if config.developer == False:
            pause 15
        "Чекати доводиться досить довго."
        "Але я нічого не можу з цим вдіяти."
        if config.developer == False:
            pause 20
        "Хотілося б мені мати можливість чимось себе зайняти, поки триває весь цей процес."
        if config.developer == False:
            pause 18
        "Мені подобається писати вірші, але гра не дає мені займатися цим."
        if config.developer == False:
            pause 3
        "Що це за дивне відчуття раптом відвідало мене?.."
        call poem (True) from _call_poem_1
        scene bg club_day with wipeleft_scene
        "ЩО ЦЕ БУЛО?"
        "Гра якимось чином дозволила мені самій написати вірш?!"
        "Я н-н-не розумію!"
        "Як це могло раптом статися?!"
        "Не можу зрозуміти."
        play music t2 fadein 4
        pause 10
        "А?"
        "Схоже, [player] вже провів свій час із Сайорі."
        "Але я все одно не можу позбутися цього дивного відчуття."
    if persistent.gameroute == "yuri":
        "Ага, отже, гравець написав вірш для Юрі."
        "Дивно, але у цій сцені для Юрі прописали невелику кількість діалогу."
        "Але мені все одно доведеться почекати хвилин 8..."
        if config.developer == False:
            pause 15
        "Чекати доводиться досить довго."
        "Але я нічого не можу з цим вдіяти."
        if config.developer == False:
            pause 20
        "Хотілося б мені мати можливість чимось себе зайняти, поки триває весь цей процес."
        if config.developer == False:
            pause 18
        "Мені подобається писати вірші, але гра не дає мені займатися цим."
        if config.developer == False:
            pause 3
        "Що це за дивне відчуття раптом відвідало мене?.."
        call poem (True) from _call_poem_2
        scene bg club_day with wipeleft_scene
        "ЩО ЦЕ БУЛО?"
        "Гра якимось чином дозволила мені самій написати вірш?!"
        "Я н-н-не розумію!"
        "Як це могло раптом статися?!"
        "Не можу зрозуміти."
        play music t2 fadein 4
        pause 10
        "А?"
        "Схоже, [player] вже провів свій час із Юрі."
        "Але я все одно не можу позбутися цього дивного відчуття."

    "Що ж, настав час ділитися віршами."
    "Мій вихід."

    hide sayori
    hide natsuki
    hide yuri
    "А ось і [player]. Я повертаюсь до нього."
    m "До речі, ти не забув учора ввечері написати вірш?"
    mc "Н-ні..."
    m "Якщо всі готові, чому б тобі не знайти когось, з ким ти можеш поділитися своїм віршем?"
    show sayori 4q zorder 2 at t22
    s "Чекаю не дочекаюся~!"
    show sayori zorder 1 at thide
    hide sayori

    "З ким він насамперед поділиться своїм віршем?"
    "Хотіла б я знати."
    $ randomiser = renpy.random.randint(0,3)
    if randomiser == 3:
        "Ого, здається, він хоче спочатку показати свій вірш мені."
        "Ну гаразд, як йому більше хочеться."
        "Кхм~"
        call day2_act1_poem from _call_day2_act1_poem
    else:
        "Втім, що все одно нічого не змінить."
        "У будь-якому випадку, мені доведеться зачекати."
        if config.developer == False:
            pause randomiser * 10 + 10
        "Моя черга."
        "Кхм~"
        call day2_act1_poem from _call_day2_act1_poem_1


label day2_act1_poem:
    m "Привіт, [player]!"
    m "Добре проводиш час?"
    mc "Е... так."
    "Рада за тебе, бо мені все це здається дивним."
    m "Добре! Рада це чути!"
    m "До речі, оскільки ти новенький..."
    m "Якщо у тебе є якісь пропозиції щодо клубу, наприклад нових заходів чи чогось, що можна було б покращити..."
    m "Я завжди готова вислухати!"
    m "Не бійся піднімати будь-які теми, добре?"
    mc "Гаразд... прийму це до уваги."
    m "У будь-якому випадку..."
    m "Не хочеш поділитися зі мною своїм віршем?"
    mc "Це досить ніяково, але, думаю, я маю це зробити."
    m "А-ха-ха-ха!"
    m "Не хвилюйся, [player]!"
    m "Нам усім сьогодні трохи ніяково."
    m "Але цей бар'єр ми скоро навчимося долати."
    mc "Так, вірно."
    m "...Мм!"
    "Зрозуміло, я навіть не можу читати його вірші."
    "Навіщо взагалі грі дбати про те, щоб я могла щось читати."
    "Хоча мене також це не турбує. Все одно у мене в руках безладний набір слів."

    if persistent.gameroute == "sayori" or persistent.gameroute == "multiple":
        "Вірш для Сайорі."
        m "Мені подобається!"

        "І це дійсно так."
        "Сайорі завжди пише свої вірші або про надію, або про її втрату."
        "Це єдина думка, якою мені самій дає проблиск надії."
        "Надії на те, що це безумство все ж таки коли-небудь закінчиться."
        "Щоправда, ці надії ніколи не збуваються."

        m "Чимось нагадує творчість Сайорі."
        mc "Ось як?"
        m "Ви з Сайорі добрі друзі, адже так?"
        m "Не дивно, що у вас є щось спільне."
        mc "А, ну..."
        mc "Може, ми й добрі друзі, але насправді дуже різні."
        m "Хм-м..."
        m "Ну, може, і так..."
        m "Але не виключено, що у вас є такі спільні риси, про які ти навіть не підозрюєш."
        m "Те, як вона говорить про тебе..."
        m "Здається, ви щиро дбаєте один про одного."
        m "Нехай навіть ви демонструєте це різними способами, але подібності в них набагато більше, ніж ти думаєш."
        m "Ось таке в мене склалося враження під час прочитання твого вірша."
        mc "Хм-м..."
        mc "Ти впевнена, що не вичитала між рядків зайвого?"
        m "А-ха-ха, цілком можливо!"
        m "О боже, я говорю як Юрі..."
        m "...Але, як би там не було, творчість Сайорі викликає теплі почуття."
        m "Я бачу, що їй подобається вивчати емоції, такі як щастя та смуток."
        m "Хіба можна було припустити, що така позитивна людина знайде своє задоволення і в сумних речах?"
        mc "Так... це цілковита несподіванка."
        m "Ну, кожному своє~"
        m "І тобі теж не варто боятися невеликих експериментів."

    if persistent.gameroute == "yuri":
        "Вірш для Юрі."
        "Ось це цікавий екземпляр."
        "Стиль письма Юрі завжди загадковий, тому її вірші завжди здаються особливими."
        "Мені вони дуже подобаються."
        m "Відмінна робота, [player]!"
        m "Поки я читала, у мене в голові звучало здивоване «о-о-о»."
        m "Дуже метафорично!"
        m "Не знаю чому, але я не очікувала, що в тебе вийде щось таке глибоке."
        m "Схоже, я тебе недооцінила!"
        mc "Мені простіше підтримувати загальні очікування на низькому рівні."
        mc "Таким чином, оточуючі вважатимуть, що я доклав якихось зусиль."
        m "А-ха-ха! Це не чесно!"
        "Більше того, це некрасиво – чинити таким чином."
        m "Втім, гадаю, це працює."
        m "Ти знав, що Юрі подобається такий стиль?"
        m "Повний образів та символізму."
        "На відміну від Сайорі, яка любить використовувати прості та прямі слова для опису щастя та смутку..."
        m "Юрі любить залишати читачеві простір для пошуку власного сенсу."
        m "Плідно писати таким чином дуже складно."
        m "Обидві вони дають читачеві щось знайти чи відчути..."
        m "Або ж дають можливість глибокого аналізу всіх нюансів.."
        m "Це може вимагати багатьох років практики, які, як я вважаю, є за плечима у Юрі."
        m "Правда, я ніколи її про це не питала..."
        mc "Упевнений, я поки що з нею і поряд не стояв."
        m "Не варто так сильно через це переживати!"
        m "У тебе є свої переваги."
        m "Просто продовжуй вчитися та пробувати нові прийоми!"

    if persistent.gameroute == "nastuki":
        "Вірш для Нацукі."
        "Досить своєрідний екземпляр."
        "Нацукі зазвичай пише в простому стилі, але кінцівки її віршів завжди запам'ятовуються."
        "Мені подобається їх читати."
        m "Мне понравилось, [player]!"
        mc "Правда?.."
        m "Набагато милий вірш, ніж я очікувала."
        m "А-ха-ха-ха!"
        "Над чим я так сміюся?"
        "Схоже, я божеволію."
        "Хехе~ Начебто мене не збожеволіли ще задовго до цього."
        mc "О боже..."
        m "Ні, ні!"
        m "Це нагадує мені щось, що могла б написати Нацукі."
        m "Вона теж дуже гарно пише."
        m "Тож можеш вважати це компліментом!"
        mc "А-ха-ха..."
        mc "Якщо ти так кажеш..."
        m "Ага!"
        m "До речі, ти не читав нічого із Шела Сільвенстейна?"
        mc "Е?"
        mc "Може, колись давно..."
        m "Він відомий тим, що розповідав різні історії всього кількома простими словами."
        m "Його вірші могли бути смішними, милими чи навіть сумними..."
        m "І часом вони складалися лише з кількох рядків."
        m "Могло навіть здатися, що вони написані для дітей, але якщо над ними подумати..."
        m "Вони висловлювали погляди на світ, які можна застосувати до будь-кого."
        mc "Ясно..."
        mc "Так ти хочеш сказати, що Нацукі така сама?"
        m "Начебто."
        m "Може, вона й не експерт..."
        m "Але навряд чи ти знайдеш у її віршах багато води."
        m "Можливо, писати їх легко, але зрозуміти закладений у них сенс дуже складно."
        m "Так що я розумію, чому ти вирішив вивчити цей тип поезії!"

    mc "Я впевнений, що я ще багато всього перепробую."
    mc "Але пройде чимало часу, перш ніж я почуватимуся комфортно за цим заняттям."
    m "Це нормально!"
    m "Я б дуже хотіла побачити, як ти пробуєш щось нове."
    "Так кажу, ніби ти матимеш шанс щось спробувати."
    m "Це найкращий спосіб знайти найбільш відповідний тобі стиль."
    m "Інші можуть трохи упереджено ставитися до стилів, відмінних від їх власного..."
    m "Але я завжди допоможу підібрати найближчий до тебе!"
    m "Тож не намагайся догодити всім і писати так, як вони того хочуть."
    m "Тобі необов'язково вражати всіх і кожного."
    m "А-ха-ха!"
    mc "А-ха-ха..."
    "А-ха-ха....."
    m "Гаразд, хочеш тепер прочитати мій вірш?"
    m "Не хвилюйся, поет із мене так собі..."
    mc "У це важко повірити, враховуючи, як впевнено ти це сказала."
    m "Ну... це тому, що я повинна так говорити."
    m "Але це не означає, що я завжди відчуваю впевненість, розумієш?"
    mc "Ясно..."
    mc "Що ж, тоді давай прочитаю."
    "Я передала йому свій вірш."
    "Те, що міститься у коді. Ні, не те, що я написала кілька хвилин тому."
    "Швидше за все, йому знадобиться час, щоб прочитати його."
    if config.developer == False:
        pause 25
    m "І... що думаєш?"
    mc "Хм-м... Його форма досить... довільна. Якщо можна так висловитись."
    mc "Вибач. Я не зовсім та людина, у кого варто запитувати відгук..."
    m "А-ха-ха. Все в порядку."
    m "Так, останнім часом такий стиль набрав популярності."
    "Що я таке несу?"
    "Коли ці твори про вигадану реальність встигли стати популярними?"
    "Може, я про щось не знаю?"
    m "Я хочу сказати, зараз у багатьох віршах приділяють особливу увагу ритмічності складу."
    m "При гучному читанні виходить сильний ефект."
    mc "Що тебе надихнуло на цей вірш?"
    m "А..."
    "Ну... багато чого."
    "Моя самосвідомість, моя депресія, мої нездійсненні надії та мрії."
    m "Ну... Я не до кінця впевнена, як це висловити..."
    m "Думаю, можна сказати, що на мене зійшло осяяння."
    m "Воно дещо позначилося на моїх віршах."
    mc "Осяяння?"
    m "Так... щось на кшталт того."
    "Щось на кшталт...."
    m "Мені трохи незатишно говорити про такі філософські речі. Це може стати досить гострою темою..."
    m "Можливо, коли всі подружаться один з одним краще."
    m "Як би там не було..."
    m "Ось тобі письменницька порада дня від Моніки!"
    "Якщо ти замкнений у дурній грі, одразу здавайся, бо все одно нічого не зможеш зробити!~"
    m "Часом, коли ти пишеш вірш чи розповідь, твій мозок надто сильно зациклюється на певному моменті..."
    m "Якщо ти всіма силами намагатимешся зробити його ідеальним, то ніколи не досягнеш жодного прогресу."
    m "Просто змуси себе продовжити писати, а його впорядкуй пізніше!"
    m "Або ось інший спосіб це уявити:"
    m "Якщо занадто довго тримати ручку в одному місці, то отримаєш тільки велику кляксу."
    m "Так що просто рухай рукою і пливи за течією!"
    m "...Це моя порада на сьогодні!"
    m "Дякую, що вислухав~"
    "А тепер забирайся до біса."
    "Пока-пока!~"

    "А я можу поки подрімати."
    "Ну чи просто заплющити очі... ви розумієте...."
    scene black with close_eyes
    pause 10
    "Зважаючи на все, йому знадобиться час, щоб поділитися віршем з усіма іншими."
    if config.developer == False:
        if not randomiser == 3:
            pause randomiser * 10

    stop music fadeout 1.0
    scene bg club_day
    with wipeleft_scene
    play music t3
    mc "Фух..."
    "А?!"
    "О-о? Він уже закінчив?"
    if randomiser == 0:
        "Він уже встиг показати вірш іншим?"
        "Ну що ж, гаразд."

    show yuri 2g zorder 2 at t21
    show natsuki 1g zorder 2 at t22
    "Ой, мало не забула."
    "Юрі та Нацукі повинні зараз посваритися."
    show yuri 2i at t21

    show natsuki zorder 3 at f22
    n 1q "{i}(Що це за стиль такий?..){/i}"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 2f "А?"
    y "Ум-м... ти щось сказала?"
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 2c "О, ні, нічого."
    n "Мабуть, можна сказати, що вірш вийшов досить витонченим."
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 2i "Ах... Дякую..."
    y "А твій... милим..."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 2h "Милим?"
    n 1h "Ти взагалі не помітила в ньому символізму?"
    n "Він же наповнений почуттям безвиході."
    n "Як таке можна назвати милим?"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 3f "Я ц-це зрозуміла!"
    y "Я мала на увазі..."
    y 3h "Віршований склад, напевно..."
    y "Я просто хотіла сказати щось хороше..."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n "А?"
    n 4w "Тобто тобі довелося напружитися, щоб видавити з себе щось хороше?"
    n "Дякую, звичайно, але в результаті нічого хорошого не вийшло!"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 1i "Ум-м..."
    y "Насправді я маю пару пропозицій..."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 5x "Хмф."
    n "Якби мені були потрібні поради, я запитала б того, кому сподобався мій вірш."
    n "І такі люди, до речі, {i} є {/i}."
    n 5e "Він сподобався Сайорі."
    n "[player] теж його похвалив!"
    n "І, коли вже в мене такий успіх, я з радістю дам тобі парочку порад."
    n "Насамперед—"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 2l "Перепрошую..."
    "Їхня суперечка з боку виглядає настільки безглуздо, що мені знову стає смішно."
    "Але навіть це встигає набридати після чергово запуску{i} нової гри{/i}."

    y "Я ціную твою пропозицію, але я вже довгий час удосконалюю свій власний стиль."
    y 2h "Я не збираюся найближчим часом його міняти, хіба що мені на очі попадеться щось, що воістину надихає."
    y "Але такого поки що не сталося."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1o "Н-н-н!.."
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 1k "І [player] мій вірш теж похвалив, дозволь помітити."
    y "Він навіть сказав, що був вражений."
    stop music fadeout 1.0
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 4y "О, правда?"
    n "Я і не уявляла, що ти так стурбована тим, щоб вразити нашого нового члена, Юрі."
    play music t7
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 1n "Е-е-е?!"
    y "Це зовсім не те, що я..."
    y 1o "У-у..."
    y "Ти... Ти просто..."
    y 2r "Може, ти просто заздриш, що [player] мої поради цінує більше за твоїх?!"
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1e "Невже! З чого це ти вирішила, що {i}мої{/i} він цінує менше?"
    n "Ти настільки самозакохана?"
    "Така сама, як і ти, Нацукі."
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 3h "Я!.."
    y "Ні..."
    y "Будь я такою..."
    y 1r "...я б точно зі шкіри геть лізла, щоб робити все солодко-милим!"
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1o "У-у-у-у-ух!.."
    show sayori 2l behind yuri, natsuki at l41
    show yuri zorder 2 at t32
    show natsuki zorder 2 at t33
    s "Е-ем!"
    s "У вас все гаразд?.."
    show sayori 2 at lhide
    hide sayori
    show natsuki zorder 3 at t22
    show yuri at t21
    n 1f "І взагалі, знаєш що?!"
    n "Це не в мене цицьки чарівним чином виросли на цілий розмір, відколи [player] вступив до нашого клубу!"
    "Нацукі, це було занадто грубо."
    "Тобі не варто казати таких речей."

    show yuri 3p at h21
    show natsuki zorder 2 at t22
    y "Н-Нацукі!"
    m "Ем, Нацукі, це трохи—"
    show yuri 3p zorder 3 at f21
    show natsuki 1e zorder 3 at f22
    ny "Тебе це не стосується!"
    "Я просто хотіла допомогти тобі, Юрі, але як скажеш."
    show yuri zorder 2 at t32
    show natsuki zorder 2 at t33
    show sayori 4p behind yuri, natsuki at l41
    s "Я н-не люблю сварок, дівчата!.."
    show sayori at lhide
    hide sayori
    show yuri zorder 2 at t21
    show natsuki 1g zorder 2 at t22
    "Раптом обидві дівчата різко повернулися до [player], наче щойно помітили його присутність.."
    "Ну, {i}\"присутність\"{/i} у переносному значенні, звісно."
    show yuri zorder 3 at f21
    y 2n "[player]...!"
    y "Вона... Вона просто виставляє мене в поганому світлі!.."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 4w "Неправда!"
    "Правда-правда."
    n "Це вона почала!"
    "Не пам'ятаю такого."
    n 4e "Якби вона поборола свою впертість і оцінила переваги {i}простого{/i} стилю..."
    n "У такому разі сперечатися взагалі було б нема про що!"
    n "Який сенс робити свої вірші такими заплутаними?"
    n "Їхній зміст має бути відразу зрозумілий читачеві, а не змушувати його лізти в нетрі."
    n 1f "[player], допоможи мені це пояснити!"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 3o "Х-хвилинку!"
    y "Зрозуміло, у нашій мові не просто так існує так багато глибоких та багатозначних слів!"
    y 3w "Це єдиний спосіб ефективно передати складні почуття та образи."
    y "Ми лише обмежуємо себе, уникаючи їх, і... багато що втрачаємо!"
    y 1t "Адже ти розумієш мене, [player]?"
    show yuri zorder 2 at t21
    mc "Е-ем!.."
    show yuri 1t zorder 3 at f21
    show natsuki 1e zorder 3 at f22
    ny "Ну???"
    mc "..."
    show yuri zorder 2 at t21
    show natsuki 1g zorder 2 at t22
    "Кого ж [player] зараз вибере?"
    if persistent.gameroute == "sayori" or persistent.gameroute == "multiple":
        call ch1_end_sayori from _call_ch1_end_sayori
    if persistent.gameroute == "yuri":
        call ch1_end_yuri from _call_ch1_end_yuri
    if persistent.gameroute == "natsuki":
        call ch1_end_natsuki from _call_ch1_end_natsuki

    scene bg club_day
    with wipeleft_scene
    m "Отже, друзі!"
    m "Настав час закінчувати сьогоднішню зустріч."
    m "Як вам, сподобався обмін віршами?"
    show sayori 4x zorder 2 at t31
    s "Було дуже весело!"
    show sayori behind yuri at thide
    show yuri 1i zorder 2 at t31
    hide sayori
    y "Можу сказати, що воно того варте."
    show yuri behind natsuki at thide
    show natsuki 4q zorder 2 at t31
    hide yuri
    n "Було непогано. Здебільшого."
    "Нарешті я в чомусь згодна з Нацукі."
    show natsuki zorder 1 at thide
    hide natsuki
    m "[player], а ти що думаєш?"
    mc "...Так, я з усіма згоден."
    mc "Це чудова тема для спільного обговорення."
    m "Чудово!"
    m "У такому разі завтра зробимо те саме."
    m "Можливо, ви дізналися щось корисне від своїх друзів."
    m "Так що ваші вірші відтепер стануть ще кращими!"
    mc "..."

    show sayori 1x zorder 2 at t11
    s "[player]!"
    s "Готовий піти додому?"
    mc "Звичайно, йдемо."
    s 4q "Е-хе-хе~"
    show sayori at thide
    hide sayori
    stop music fadeout 15
    "Кажу вам обом до побачення."
    "Побачимося за кілька хвилин..."
    pause 10
    scene black with close_eyes
    "Мій улюблений час. Коли я нарешті можу трохи розслабитись."
    pause 10
    y "{size=10}Моніка?{/size}"
    pause 2
    n "{size=10}Моніка!{/size}"
    "Хтось мене кликав?"
    "Швидше за все, мені здалося."
    ny "{size=40}МОНІКА!{/size}" with Shake((0,0,0,0), 0.7, dist=20)
    "Що?!"
    scene bg club_day with wipeleft_scene
    show yuri 3e at t21
    show natsuki 1c at t22
    pause 0.4
    show natsuki 1b at f22
    n "Моніка, все гаразд?"
    "?"
    n "Моніка, ти щойно спала прямо на парті, ти добре почуваєшся?"
    show natsuki 1c at t22
    "Це вже стає цікавим."
    show yuri 3f at f21
    y "Напевно, ти вчора довго не лягала спати?"
    y 2h "Заради твого здоров'я краще так не робити."
    show yuri 1s at t21
    m "Дівчатка, ну зі мною все гаразд, правда."
    m "Мені просто захотілося трохи відпочити."
    show natsuki 3u at f22
    n "Може, ти хочеш, щоб хтось із нас провів тебе додому?"
    show natsuki 3n at t22
    m "Ні, ні, чесне слово, я добре почуваюся."
    show yuri 1m at f21
    y "Я таки наполягаю. Буде краще, якщо дорогою додому в тебе буде компанія."
    show natsuki 1l at f22
    show yuri 1a at t21
    n "І я також хочу піти! Адже це так класно - прогулятися разом з друзями!"
    show natsuki 1j at t22
    "Мабуть, вони від мене не відстануть, доки не відведуть додому."
    "Схоже, я не маю вибору."
    m "Ну гаразд. Ходімо разом."
    show natsuki 1z at h22
    show yuri 3c at h21
    ny "Ура!"
    scene black with dissolve_scene_full
    "І ось ми стоїмо біля мого \"дому\"."
    n "Ось ми й прийшли, Моніко!"
    y "Бажаю тобі добре провести решту дня!"
    m "Дякую, дівчата, але вам правда не варто було виявляти до мене таку турботу."
    y "Ой, добре тобі, це справді дрібниця!"
    n "Тим більше, що гуляти з друзями завжди весело."
    m "Так, ти права."
    m "Гаразд, до зустрічі!"
    ny "Пока-пока~"
    "Я зайшла до будинку і попрямувала до своєї кімнати."
    "Зайшовши в неї, я не на жарт здивувалася побаченому."
    play music tmonika fadein 2
    scene bg monika_bedroom with wipeleft_scene
    "У мене з'явилася справжня кімната."
    "З ліжком, столом, книжковою шафою."
    "Тут так мило, приємно і{w} спокійно."
    "Що ж, мабуть, тепер мені треба написати вірш."
    call poem (True, None) from _call_poem_3
    scene bg monika_bedroom with wipeleft_scene
    "Думаю, з цим покінчено."
    "Все навколо мене поступово починає набувати обрисів реальності."
    "Не можу передати, як сильно я чекаю завтрашнього дня."
    "Але чому все це відбувається?"
    "Щось тут не так."
    "Чи варто мені спробувати докопатися до причини, чи краще просто насолоджуватися цією реальністю, що змінилася на краще.?"
    "Я не знаю."
    stop music fadeout 2 
    jump day3_act1

    return

label ch1_end_natsuki:
    $ ch1_choice = "natsuki"
    stop music fadeout 1.0
    "Звичайно ж, [player] вибрав Нацукі..."
    mc "Ем..."
    mc "Юрі!"
    mc "У тебе справжній талант."
    show yuri 4a at s21
    y "Е? Дя--"
    play music t8
    mc "Але Нацукі права!"
    mc "Я думаю, що..."
    show yuri zorder 2 at t21
    mc "Я думаю, що здатність передати свої почуття лише кількома простими словами..."
    mc "Може справити анітрохи не менше враження!"
    mc "Це змушує читача підключити свою уяву."
    mc "І вірш Нацукі чудово справляється з цим завданням!"
    show natsuki zorder 3 at f22
    n 5y "...Саме так!"
    n "Воно з цим впоралося, чи не так?!"
    n "А-ха-ха!"
    n "Це чудовий показник, наскільки {i}ти{/i} не розбираєшся в цьому!"
    "Я ніколи не могла зрозуміти, чому Нацукі так зазнається після того, як її підтримали."
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 4b "Я не зовсім..."
    show yuri zorder 2 at t21
    mc "Нацукі..."
    mc "Тобі варто зупинитися."
    show natsuki zorder 3 at f22
    n 1m "А?"
    n "Мені?"
    n "Але вона була така несправедлива до мене!.."
    "Говорячи відверто, мені здається, що ти була несправедливіша до неї, ніж вона – до тебе."
    show natsuki zorder 2 at t22
    mc "Слухай..."
    mc "Не слід забувати про те, про що ми говорили вчора."
    mc "У кожного свій власний стиль."
    mc "Ділитись з іншими своєю творчістю може бути непросто."
    mc "Мені здається, сьогодні ми засвоїли цей урок."
    mc "Навіть невелика критика може розпалити люту полеміку."
    mc "Я просто хочу сказати..."
    mc "Не сердись на Юрі."
    mc "В тебе чудові вірші, Нацуки."
    show natsuki zorder 3 at f22
    n 1h "Ах--"
    n 1q "...Дякую, що помітив."
    show natsuki zorder 2 at t22
    mc "Юрі..."
    show yuri zorder 3 at f21
    y 4a "...?"
    show yuri zorder 2 at t21
    mc "Я впевнений, що Нацукі все говорила не всерйоз."
    mc "Тобі теж не потрібно на неї ображатися."
    show yuri zorder 3 at f21
    y 2v "Ум-м..."
    y "Якщо ти так кажеш..."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1g "Ей!.."
    n "Нічого тут {i}за{/i} мене вибачатись, [player]."
    n 1w "Блін."
    n 1q "Я..."
    n "Щодо цього..."
    n "У-ух..."
    "Нацукі обвела очима клас."
    show natsuki zorder 3 at hf22
    n 1x "{i}Ви перестанете всі на мене витріщатися?{/i}"
    "Так ніхто і не витріщався."

    show natsuki zorder 3 at f22
    n 1i "Хмф."
    n "Короче!.."
    n 1q "На рахунок твоїх грудей я говорила не всерйоз, ясно?"
    n "Це все, що я хотіла сказати."
    "Мда, я очікувала більш \"чистосердечного\" вибачення, але добре, нічого не маю проти."
    "Нацукі відвернулася, уникаючи поглядів оточуючих."
    show natsuki zorder 2 at t22
    show sayori 4x behind yuri at l41
    s "Точно! Ти красуня від природи, Юрі!"
    mc "Сайорі?!"
    show yuri 4c zorder 3 at f21
    y "..."
    y "Я п-піду заварю чай..."
    show yuri at lhide
    hide yuri
    show sayori zorder 3 at f41
    s 4h "Е-е-е?"
    s "Я просто намагалася допомогти!"
    show sayori zorder 2 at t41
    mc "Впевнений, їй приємні твої слова, Сайорі."
    show sayori zorder 1 at thide
    show natsuki zorder 1 at thide
    hide sayori
    hide natsuki
    m "Добре, якщо це питання вирішене..."
    m "Адже ви всі поділилися один з одним своїми віршами, вірно?"
    "Чи не надто некрасиво я поводжуся відразу після того, що щойно сталося?"
    "Втім, яка різниця."
    m "Сподіваюся, для вас це був цінний досвід!"
    m "Особливо для тебе, [player]!"
    m "І, якщо чесно..."
    m "Для нас це гарна зміна ритму. Надані самі собі, ми надто звикли ледарювати."
    m "Ахаха!"
    mc "А-а, так, значить, вступивши до клубу, я зруйнував вашу атмосферу..."
    m "Ні-ні, що ти!"
    m "До кінця клубної діяльності ще є небагато часу."
    m "Давайте трохи відпочинемо."
    m "Зрозуміло, крім балачок ми також займаємося речами, пов'язаними з літературою..."
    m "Ти можеш скористатися цією можливістю і взяти почитати книжку чи щось написати."
    m "Адже саме для цього і було створено клуб!"
    "Якщо не рахувати того факту, що я єдина, хто не відпочиває ніколи."
    show sayori 2j zorder 3 at f31
    s "Я не згодна з тобою, Моніка!"
    show sayori zorder 2 at t31
    m "А? Нарахунок чого?"
    show sayori zorder 3 at f31
    s 2i "Це не найважливіше у літературному клубі!"
    s "Важливіше всього..."
    show sayori 4r zorder 3 at hf31
    s "Щоб тут було весело!"
    "Особисто мені ніколи не буває весело."
    show sayori zorder 2 at t31
    m "Ахаха, ну звичайно..."
    m "І саме тому віце-президент тут ти, Сайорі."
    show sayori zorder 3 at f31
    s 4q "Е-хе-хе..."
    hide sayori
    with wipeleft

    return

label ch1_end_yuri:
    $ ch1_choice = "yuri"
    stop music fadeout 1.0
    "Звичайно ж, [player] вибрав Юрі."
    mc "Нацукі."
    mc "Це так, твій вірш мені сподобався."
    show natsuki zorder 3 at f22
    n 1e "Бачиш?"
    show natsuki 1g zorder 2 at t22
    play music t8
    mc "Секунду!"
    mc "Але, навіть якщо так, ти не повинна бути такою упередженою!"
    mc "Тобі не варто сваритися з подругою тільки тому, що її думка відрізняється від твоєї."
    show natsuki zorder 3 at f22
    n 1m "Але все зовсім не так!"
    n "Юрі навіть не сприймає мого вірша всерйоз!"
    show natsuki zorder 2 at t22
    mc "Хм-м..."
    mc "Я розумію."
    mc "Юрі."
    show yuri zorder 3 at f21
    y 2t "Так?"
    show yuri zorder 2 at t21
    mc "Я серйозно вважаю тебе талановитим письменником."
    mc "Що тут таїти, я був вражений."
    show yuri zorder 3 at f21
    y 2u "Ум-м, це дуже..."
    show yuri zorder 2 at t21
    mc "Але в чому..."
    mc "Неважливо, чи простий у людини стиль письма чи витончений..."
    mc "Він все одно вкладає почуття у свою творчість, вона стає чимось дуже особистим.."
    mc "Тому, коли ти назвала її вірш милим, це зачепило Нацукі."
    show yuri zorder 3 at f21
    y 2v "Я... розумію..."
    y "Я і не замітила, що..."
    show yuri zorder 2 at t21
    y 2w "П-прошу пробачення..."
    show yuri at s21
    y "У-ум..."
    show natsuki zorder 2 at t11
    show yuri zorder 1 at thide
    hide yuri
    mc "Проте, Нацукі, ти зайшла надто далеко!"
    mc "Юрі не хотіла сказати нічого поганого, і якби ти одразу розповіла, що відчуваєш..."
    mc "Усього цього можна було б уникнути."
    n 1e "Ти смієшся з мене?"
    n "Саме так я і вчинила!"
    n "Це ж {i}вона{/i}--"
    show natsuki zorder 2 at t22
    m "Нацукі, я думаю, настав час зупинитися."
    "Блін, я вже так від цього втомилася."
    m "Ви обидві наговорили того, чого не варто було говорити."
    m "Юрі вже вибачилася. Може, й тобі не завадить?"
    show natsuki zorder 3 at f22
    n 1x "Н-н-н!.."
    show natsuki zorder 2 at t22
    "Ну...?"
    show natsuki zorder 2 at t33
    show sayori 2h at l41
    s "Ем!"
    s "Часом, коли мені сумно..."
    s "Я йду прогулятися, щоб провітрити голову!"
    "Або повісити її."
    show sayori zorder 2 at t41
    mc "Сайорі, їй не треба--"
    show natsuki zorder 3 at f33
    n 2q "А знаєте що?"
    "Мабуть, так і зроблю."
    n 2w "Принаймні не потрібно буде споглядати ваші обличчя."
    show natsuki zorder 1 at thide
    hide natsuki
    "Нацукі зім'яла свій вірш і вийшла з класу, по дорозі кинувши його у відро для сміття."
    "Мені здається, вона надто гостро реагує."
    show sayori zorder 3 at f41
    s 1k "Нацукі..."
    show sayori zorder 2 at t41
    m "Їй зовсім необов'язково було це робити..."
    show sayori zorder 1 at thide
    hide sayori
    show yuri 4b zorder 2 at t11
    y "Ех..."
    mc "У тебе все нормально?"
    y "Мені так соромно..."
    y "Не можу повірити, що так повелася."
    y "Ти зараз, мабуть, терпіти мене не можеш..."
    mc "Все не так, Юрі!"
    mc "Як взагалі хтось може не засмутитися, після того, як йому такого наговорили?"
    mc "Будь-яка інша людина мала б схожу реакцію."
    mc "Моя думка про тебе нітрохи не стала гіршою."
    y 2v "Ум-м..."
    y "...Добре, я вірю тобі."
    y 2s "Дякую, [player]. Ти надто добрий."
    y "І я вдячна за те, що ти став членом нашого клубу."
    mc "Е-е-е, та пусте."
    y 2v "І ще дещо..."
    y "Щодо того, що сказала Нацукі..."
    y 4c "Ну про... мої..."
    y "Я б ніколи не зробила нічого такого... ганебного..."
    y "Так що..."
    mc "...А?"
    mc "Що саме сказала Нацукі?"
    y 3n "--!"
    y "Ум-м!"
    y 3q "Нічого, просто забудь..."
    y "Я п-піду заварю чай..."
    mc "А, гарна думка."
    mc "Зроби на кілька людей, добре?"
    y "Т-так."
    "Мені шкода Юрі."
    "Але що я можу зробити?"
    return

label ch1_end_sayori:
    $ ch1_choice = "sayori"
    "Він вибрав допомогу Сайорі."
    "Думаю, це найкращий вибір."
    mc "Н-Нацукі..."
    show natsuki 5f
    mc "Юрі..."
    y 4a "..."
    stop music fadeout 1.0
    mc "..."
    mc "...Сайорі!"
    show sayori 4m behind yuri at l31
    show yuri zorder 2 at t32
    show natsuki zorder 2 at t33
    s "Е?!"
    mc "...Так!"
    mc "Сайорі стає погано, коли люди сваряться."
    mc "Як ви можете продовжувати це, бачачи,в який стан привели свою подругу?"
    show sayori zorder 3 at f31
    s 4d "[player]..."
    show sayori zorder 2 at t31
    show natsuki 4w zorder 3 at f33
    n "Що ж... Це проблема Сайорі! І взагалі, її це не стосується."
    show natsuki zorder 2 at t33
    show yuri 2g zorder 3 at f32
    y "Я з-згодна..."
    y "Нечесно, що інші домішують свої почуття у наш конфлікт."
    show yuri zorder 2 at t32
    show natsuki zorder 3 at f33
    n 4c "Точно! Якщо тільки Сайорі не хоче сказати Юрі, що та зараз поводиться як уперта дурепа."
    show natsuki zorder 2 at t33
    show yuri 3r zorder 3 at f32
    play music t7
    y "Вона б ніколи так не сказала!.."
    y "Взагалі, її швидше засмутила твоя дитяча поведінка!"
    show yuri zorder 2 at t32
    show natsuki 1e zorder 3 at f33
    n "{i}Прошу пробачення?{/i}"
    n "Ти хоч себе чуєш?"
    n 1x "Саме тому..."
    n 1w "Тому ніхто не любить--"
    show natsuki zorder 2 at t33
    show sayori 4p at h31
    stop music
    s "{i}Припиніть!{/i}"
    "Дякую тобі велике!"
    show yuri 3f zorder 3 at f32
    show natsuki 1o zorder 3 at f33
    ny "--"
    show yuri zorder 2 at t32
    show natsuki zorder 2 at t33
    show sayori zorder 3 at f31
    play music t8
    s 1h "Нацукі! Юрі!"
    s "Адже ви мої друзі!"
    s 1v "Я просто хочу, щоб усі ладнали один з одним і були щасливі!"
    s "Мої друзі – чудові люди..."
    s "І я люблю їх саме через їх відмінності!"
    s 1g "Вірші Нацукі..."
    s "Вони неймовірні, адже ними вона може передати стільки різних почуттів лише кількома простими словами!"
    s "І вірші Юрі неймовірні, адже вони здатні створювати у вашій уяві чудові картини!"
    s 4k "Ви всі такі талановиті..."
    s "...Так чому ж ви сваритеся?.."
    show sayori zorder 2 at t31
    show natsuki zorder 3 at f33
    n 1r "Т-тому що..."
    show natsuki zorder 2 at t33
    show yuri 3v zorder 3 at f32
    y "Ум-м..."
    show yuri zorder 2 at t32
    show sayori zorder 3 at f31
    s 1j "А ще!"
    s "Нацукі мила і нічого поганого в цьому немає!"
    s 1i "А цицьки Юрі такі ж, якими були завжди!"
    show sayori at hf31
    s 1j "Великі і красиві!!"
    show sayori 1i zorder 2 at t31
    show natsuki zorder 3 at f33
    n 1o "..."
    show natsuki zorder 2 at t33
    show yuri zorder 3 at f32
    y 3n "..."
    show yuri zorder 2 at t32
    mc "Сайорі..."
    show yuri at s32
    y 3q "Я... приготую трохи чаю..."
    show yuri behind sayori at lhide
    hide yuri
    "Юрі ретирувалася."
    show natsuki zorder 1 at thide
    hide natsuki
    "Нацукі з порожнім виразом обличчя сіла за парту і дивилася в нікуди."
    show sayori zorder 1 at thide
    hide sayori
    mc "А, так ось чому Сайорі віце-президент клубу..."
    "Це правда."
    "Сайорі неймовірно добре вміє як створювати проблеми, так і вирішувати їх."
    "Але кожен окремий рядок цього діалогу вже написано, тож чому мене взагалі це хвилює?"
    m "Честно кажучи..."
    m "Може, я й виглядаю як добрий лідер і здатна все організувати..."
    m "Але мені погано виходить взаємодіяти з людьми в такі моменти..."
    m "Я навіть не змогла змусити себе втрутитися."
    m "Мені, як президенту клубу, соромно за цей випадок."
    "Не те щоб я взагалі нічого не змогла б зробити, але я не думаю, що мені вдалося б впоратися з цією ситуацією краще, ніж Сайорі."
    m "А-ха-ха..."
    mc "Все добре..."
    mc "Я не можу тебе звинувачувати."
    mc "Адже я теж ніяк не зміг вплинути на ситуацію."
    m "Хм..."
    m "Виходить, що наша Сайорі по-своєму дивовижна, чи не так?"
    mc "Мабуть, що так."
    mc "Можливо, у неї вітер у голові, але іноді навіть підозріло, як добре вона знає, що потрібно зробити чи сказати."
    m "Ясно~"
    m "Бережи її, гаразд?"
    m "Я б не хотіла бачити її в болі."
    mc "І не лише ти..."
    mc "Можеш на мене покластися."
    "Так, у цьому я не маю сумніву."
    return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
