
label day3_act1:
    scene bg corridor
    with dissolve_scene_full
    play music t2
    pause 5
    "Новий день, нові питання."
    "Я чекаю за дверима клубу, вони не можуть побачити мене зараз."
    "Втім, вони взагалі нічого не можуть побачити, доки не прийде ГГ."
    "Або принаймні так я думаю. Різні дивні речі відбувалися останнім часом."
    "Мені іноді подобається спостерігати за тим, що вони роблять, нехай навіть я завжди бачу одне й те саме."
    "ГГ зайшов до класу."
    "Я заглядаю всередину."
    scene bg club_day with scene_dissolve
    "А ось і Сайорі."
    show sayori 2x zorder 2 at t11
    "Зараз вона скаже \"Привіт, [player]\"."
    s "Привіт, [player]~"
    "А [player] відповість \"Привіт, Сайорі\"."
    mc "Хей, Сайорі."
    "Діалог трохи змінився."
    "Побачимо, що буде далі. Може щось ще зміниться."

    mc "У когось сьогодні гарний настрій."
    s 1q "Е-хе-хе~"
    s "Напевно, річ у тому, що я ще не звикла бачити тебе у клубі."
    mc "Зрозуміло..."
    mc "...Треба ж як мало потрібно для твого гарного настрою."
    mc "Але, мабуть, радість простим речам – твоя унікальна риса."
    s 1d "До речі, про прості речі..."
    s "Я, здається, зголодніла..."
    "Що ж, ця частина діалогу, здається, залишилася незмінною."
    s "Давай разом сходимо купимо щось перекусити."
    "Зараз він відмовиться."
    mc "Звісно, давай."
    "Що?!?!" with Shake ((0,0,0,0), 0.5, dist=5)
    "Це все так дивно!"

    s 4h "Е-е??"
    s 4r "Ооо?! Дякую тобі~"
    "Взагалі, я нічого не маю проти трохи зміненого діалогу, але схоже, що вся гра починає змінюватись."
    show sayori 4q at t11
    mc "Прогуляємося до найближчого торгового автомату?"
    s 4r "Ага!"

    show player 2a at i21
    pause 0.3
    show player 2a at thide
    show sayori 4q at thide
    hide sayori
    hide player
    $ config.allow_skipping = True
    $ style.say_dialogue = style.normal
    "ЩО ЦЕ БУЛО?!?!" with Shake ((0,0,0,0),1,dist=20)
    "Н-н-невже я щойно бачила протагоніста?!"
    "Н-ні! Цього не може бути!"
    scene bg corridor with scene_dissolve
    show player 2c at t21
    show sayori 1a at t22
    mc "О? Привіт, Моніка, ми тут вирішили сходити купити собі їжу."
    "Просто зберись. Потім все обміркуєш."
    m "О?! Звісно! Ідіть, друзі, я-я почекаю вас у класі."
    show sayori 2x
    s "Добре, а ти не хочеш, щоб ми тобі щось принесли?"
    m "Н-ні... Дякую."
    mc "М-м-м, ну добре тоді."
    show player at thide
    show sayori at thide
    hide sayori
    hide player
    scene bg club_day with wipeleft_scene
    "Що ж, побачимо, що тут у нас."
    "Щось і справді змінилося, як мені здається."
    "Але тепер у мене відчуття, наче вся гра змінилася."
    "Немов... хтось вдихнув у неї життя."
    show natsuki 4m at t11
    n "Гей, Моніко, все гаразд? Ти якась бліда."
    n "І вчора ти теж дивно поводилася."
    m "Не хвилюйся за мене, я в порядку."
    m "Просто трохи втомилася, нічого страшного."
    n 1n "Добре, але якщо у тебе виникне проблема, ти скажи."
    m "Звичайно, але я добре почуваюсь, Нацукі, чесне слово."
    n 2l "Ну добренько."
    show natsuki at thide
    hide natsuki
    "Я сіла за парту."
    "Все так дивно."
    "Треба перевірити файли, може мені вдасться зрозуміти, в чому справа."
    "Але гравець може дізнатися про все раніше, ніж слід."
    "На такий ризик я не можу піти."
    "Але що мені робити?"
    "Я озирнулася, щоб подивитися, чим зайняті Нацукі та Юрі."
    "Обидві, схоже, зайняті читанням."
    "Але вони не виглядають такими ж неживими, як завжди."
    "Вони рухаються і, схоже, справді читають, а не сидять на одному місці у застиглих позах."
    "Як гра раптом могла так ожити?"
    "Двері відчинилися."
    show sayori 4q at t22
    show player 2a at f21
    mc "Привіт, ми повернулися."
    show player at t21
    show sayori 4r at f22
    s "Така смачна шоколадка!~"
    s "Дякую тобі, [player]!~"
    show sayori 3q at t22
    show player 4g at f21
    mc "Та годі тобі, Сайорі, я нічого особливого не зробив. Пригостив тебе, і все."
    show player 4g at t21
    show sayori 3r at f22
    s "Важливо не кількість уваги, а те, до кого ти його виявляєш."
    s "І взагалі, такий простий знак уваги дуже важливий для мене!~"
    show sayori 3q at t22
    show player 4c at f21
    mc "Хех, дякую, Сайорі."
    show sayori at thide
    hide sayori
    mc "Слухай, Юрі."
    show yuri 2e at t22
    y "А? Ти мене кликав?"
    mc 2c "Я теж приніс тобі трохи шоколаду, тримай!"
    show player 2a at t21
    y 2g "О-о! Це..."
    show yuri at s22
    y 3q "Це дуже мило з твого боку, [player]."
    mc "Ха, та це дрібниці."
    show natsuki 1s at t44
    pause 1
    show natsuki 12b at s44
    show player 1h at t21
    pause 1
    show natsuki 12b at thide
    hide natsuki
    y 3c "М-м-м~ Дуже смачно."
    mc 2c "Можеш не дякувати."
    show yuri at thide
    hide yuri
    mc "Ей, Нацукі!"
    show natsuki 5s at t22
    n "А? Що таке?"
    mc "Заплющ очі і витягни руки вперед."
    n 5w "Що? Це ще для чого?"
    mc 1s "Просто зроби це."
    show player 1d at t21
    n 5s "Нгх--! Ну добре."
    n 12e "Дурня якась!"
    "[player] опустив ще одну зі своїх шоколадок у долоню Нацукі."
    n 1u "А?"
    n "Н-но..."
    n 1n "Але ж я не просила жодного шоколаду."
    mc "Юрі також не просила. Я зробив це сам, з власної ініціативи."
    mc 1p "Це найменше, що я міг зробити після того, як скуштував твої смачні кекси!"
    show natsuki 1u at s22
    pause 1
    show natsuki 1d at f22
    n "Дякую, [player]! Я оцінила!"
    show natsuki 1a at t22
    mc 2c "Без проблем!"
    show natsuki 1z at h22
    n "І справді дуже смачно!"
    "Нацукі ніколи ще не поводилася так мило."
    "Це дивно, але водночас неймовірно цікаво."
    show natsuki at thide
    hide natsuki
    show player 2a at t11
    "А тепер [player] прямує в мій бік."
    show player 2c at f11
    mc "Гей, Моніко! Дозволь, я теж тебе пригощу."
    show player 2a
    m "Ой! Ем-м... Дякую!"
    mc 1t "Тобі такі не до смаку?"
    mc 1u "Я можу принести тобі іншу, якщо хочеш!"
    show player 1t at t11
    m "О! Ні, ні, все добре!"
    m "Просто...."
    m "Просто я трохи втомилася, от і все."
    mc 1g "О, тоді зрозуміло."
    mc 1f "А ти..."
    mc 1o "Ти не проти, якщо ми сьогодні проведемо трохи часу разом?" with Shake((0,0,0,0), 1, dist= 10)
    "{size=50}ЩО ВІН ЗАРАЗ СКАЗАВ?"
    "Що це?!?!?"
    "У мене раптово з'явився «рут»?"
    "Це стає все загадковіше з кожною секундою!"
    mc 1j "Все гаразд?"
    m "Так-так, все чудово!"
    m "Кхм... Звичайно ж, ми можемо провести час один з одним."
    m "Просто це було трохи несподівано."
    mc 1k "Ну гаразд!"
    show player at thide
    hide player
    "[player] пішов за стільцем."
    "Ні... мені це сниться."
    show player 1c at t11
    mc "Ну що, хочеш почитати щось? Або, може, напишемо вірш?"
    show player 1a
    m "Стривай хвилину!"
    m "Виходить, ти хочеш провести час зі мною тільки тому, що вчора забув написати вірш?!"
    mc 1j "Що? Ні! Мій вірш у мене із собою."
    "[player] дістав аркуш паперу зі свого портфеля."
    mc "Ось, глянь."
    show player 1a
    call showpoem (poem_player, music=False) from _call_showpoem
    "....."
    "О боже."
    "Це просто чудовий вірш."
    "Но....."
    "Як? Чому?"
    "Як він зміг написати справжній вірш?"
    "І чому я тепер можу прочитати його?"
    "І чому саме зараз?"
    "Я молилася цілими днями, щоб це сталося!"
    "Не днями... тижнями!!"
    mc 1g "Воно тобі не дуже подобається, так?"
    m "А..."
    m "Ні!"
    m "Мене воно просто вразило."
    m "Це дуже хороший вірш, [player]."
    m "Можу я тебе спитати... Про що ти думав, коли писав його?"
    mc 1h "А ти не здогадуєшся?"
    m "Ну... зазвичай я можу зрозуміти, для кого ти пишеш свої вірші, але на цей раз все по-іншому."
    mc 3g "Так... ти мене ставиш у незручне становище."
    mc "Я думав про тебе."
    m "О. Ясно."
    "Я відчуваю, як починаю червоніти."
    "Це все, чого я могла тільки побажати, я не можу лише зрозуміти, як таке могло статися."
    m "Хочеш тепер прочитати мій вірш?"
    mc 1a "Не бачу причин відмовлятися."
    "Я передала йому свій вірш."
    pause 3

    mc "Хм..."
    mc "Це навіть абстрактніше, ніж попереднє..."
    m "А-ха-ха..."
    m "Думаю, у мене просто такий стиль..."
    m "Вибач, якщо тобі не подобається."
    mc "Ні, я ніколи такого не казав."
    mc "Просто, напевно, колись я нічого подібного не бачив."
    m "Мені просто подобається грати з місцем на папері..."
    m "Залежно від того, де і як ти розташуєш слова, настрій вірша може повністю змінитись."
    m "Це майже як магія."
    m "Те, що я пишу такі короткі рядки, створює враження, ніби вони намагаються перекричати шум."
    mc "Ясно..."
    mc 1g "Хоча мені, як і раніше, важко зрозуміти, про що вірш."
    show player 1a at t11
    m "А-ха-ха."
    m "Часом не варто питати, про що вірш."
    m "Вірш може бути настільки ж абстрактним, як фізичний вираз почуттів."
    m "Або розмова з читачем."
    m "Коротше кажучи, не кожен вірш {i}про щось{/i} розповідає."
    m "У будь-якому випадку..."
    m "Ось тобі письменницька порада дня від Моніки!"
    m "Іноді ти опиняєшся перед важким вибором..."
    m "У таких випадках не забувай зберігати гру!"
    m "Ніколи не знаєш, коли ти можеш передумати..."
    m "...або коли може статися щось несподіване!"
    mc 1h "Зберігати гру? Що ти маєш на увазі?"
    "Він поставив мені запитання?"
    "Потрібно рятувати ситуацію."
    m "Ну... у багатьох іграх тобі іноді потрібно зберігатися, щоб поекспериментувати з різними виборами."
    m "Так само і в житті: коли ти опиняєшся перед вибором, тобі потрібно бути обережним."
    m "І коли ти щось пишеш, тобі теж потрібно не забувати про це."

    m "...Це моя порада на сьогодні!"
    m "Дякую, що вислухав~"
    mc "Я все зрозумів."
    mc 1a "Це і справді дуже хороша порада."
    mc "Дякую, Моніка!"
    m "Е-хе-хе~"
    "Я привітно посміхнулася."

    m "Гаразд... чим би ти хотів зайнятися зараз?"
    mc 1a "А {i}ти{/i} сама чим хочеш зайнятися?"
    "У мене з'явився шанс поставити йому кілька запитань."
    m "Як щодо того, щоб просто поговорити?"
    mc "Про що б ти хотіла поговорити?"
    m "Давай подумаємо..."
    m "Чим ти займався вчора та позавчора після клубу?"
    mc "Я просто приходив додому та писав вірш до наступної зустрічі."
    mc 1g "Я не дуже активний хлопець."
    mc "Вважаю за краще сидіти і відпочивати."
    m "Такий спосіб життя не піде тобі на користь."
    mc 1i "Я знаю! Я вже планую почати робити пробіжки."
    m "Це цікаво, а скільки ти можеш пробігти?"
    mc 1g "Та я ще навіть не пробував."
    show player 1a at t11
    "Як же мені запитати його про цю гру?"
    m "А з тобою не відбувалося нічого дивного останнім часом?"
    mc "Та наче ні."
    "Ну звісно ні."
    m "А можна тобі поставити дивне, навіть особисте запитання?"
    mc "Звичайно, питай все, що хочеш."
    m "Хто для тебе найближча людина у клубі?"
    show player 1h at h11
    mc "!!!"
    mc "Ох..."
    mc 3y "Це і справді дуже особисте питання."
    m "Я знаю, вибач."
    mc "Я не думаю, що якась конкретна людина мені найближча."
    mc "Я хочу розподіляти свій час порівну на всіх."
    mc 1a "Але якщо мені таки треба когось назвати, то, напевно, це буде Сайорі, адже ми з нею вже довгий час дружимо."
    if persistent.gameroute == "sayori" or persistent.gameroute == "multiple":
        "Ну розуміється."
    else:
        "Ось як? Цікаво."
    "Про що б його запитати?"
    m "А що ти робитимеш сьогодні після клубної зустрічі?"
    mc "Я просто прогуляюся додому разом із Сайорі, потім напишу вірш... ну, тобто якщо ти знову даси нам таке завдання."
    m "Ха, ще б пак."
    m "А тобі подобається писати вірші та потім ділитися ними з іншими?"
    mc "Для мене це щось зовсім нове, тому мені нелегко, але мені дуже цікаво дізнаватися про інші письменницькі стилі."
    mc "До речі, про це, ти не думаєш, що настав час нам обмінюватися віршами один з одним?"
    m "Так, думаю, ти маєш рацію."
    scene bg club_day with wipeleft_scene
    play music t5
    m "Отже, друзі, час ділитися віршами!"
    show sayori 4s at f33
    s "Цур я перша з ним ділюся!!!"
    show sayori at lhide
    hide sayori
    "Ну добре..."
    show yuri 1a at t21
    y "Нацукі, не бажаєш показати мені свій вірш?"
    show natsuki 2z at t22
    n "Ага, зараз!"

    "Мда, схоже, знову мені доведеться чекати."
    n 1l "Моніка, чи не хочеш до нас приєднатися?"
    "Або не доведеться."
    m "З радістю!"

    m "Ну то що, хто почне?"
    n 1a "Юрі, покажеш спочатку своє?"
    y 1a "Звичайно, чому б ні?"
    call showpoem (poem_y2_yeet) from _call_showpoem_1
    m "Тобі й справді подобається писати в цьому загадковому стилі, чи не так, Юрі?"

    y "Мені подобається експериментувати."
    y "Поезія – лише один із можливих способів."
    n 1c "Мені здається це трохи дивним."
    n "Мені здається, що коли ти пишеш, тобі потрібно думати про те, що твій майбутній читач має зрозуміти, яке повідомлення ти хочеш йому передати."
    y 1c "Ти маєш рацію, це хороший спосіб, але ти впевнена, що йому буде цікаво, якщо сенс вірша лежатиме на поверхні?"
    n 1d "Ну, якщо ти хочеш викликати у нього головний біль, то твій стиль він надовго запам'ятає."
    show yuri 3d at h21
    y "Хе-хе~"
    n 1z "Хах."
    "Вони не сваряться через це?"
    "Вони просто жартують?"
    y 1a "А ти до якої точки зору схиляєшся, Моніка?"
    n 1a "Так, ти що думаєш?"
    m "Я думаю, ви обидві неправі."
    m "Я вважаю, що поезія, та й взагалі будь-яка форма мистецтва, не зобов'язані щось передавати."
    m "Мені здається, що якщо ти щось створюєш, то ти робиш це тому, що тобі це подобається, а не заради того, щоб твій твір приніс комусь користь."
    y 1m "Це справді дуже гарний погляд на цю проблему."
    n "Мені подобається твій хід думок, Моніка."
    show natsuki 1z at h22
    n "У будь-якому разі! Моя черга!"
    call showpoem (poem_n2_yeet) from _call_showpoem_2
    m "Нацукі, це якось грубувато вийшло!"
    n 1u "Так, не дуже добре вийшло. Вчора був важкий день."
    "Вона не стала стверджувати, що це її найкращий вірш?"
    y "Мені сподобалося, Нацукі."
    y "Навіть краще, ніж твій вчорашній вірш."
    n 1l "Дякую, Юрі!"
    y 1a "Моніко, покажеш тепер свій?"
    m "Так, звісно."
    pause 3
    show yuri at t21
    n 1n "Воно... цікаве."
    y "Я б навіть сказала, дуже загадкове."
    n 1k "Може, навіть загадковіше, ніж твої вірші, Юрі."
    m "Ви так думаєте?"
    m "В-ви ж не хочете сказати, що це погано, так?"
    y 2n "Щ--? Ні! Ні в'якому разі!"
    show yuri 2o at t21
    "О-о-о-о..."
    n "Напевно, справа у твоєму стилі..."
    m "Ха-ха, ну так..."
    "Я озирнулась і помітила, що Сайорі та [player] вже відійшли один від одного.."
    m "Що ж, піду поділюся віршем із Сайорі, здається, вони вже закінчили."
    y 2q "Добре..."
    n 1l "Побачимось."
    show yuri at thide
    hide yuri
    show natsuki at thide
    hide natsuki
    m "Гей, Сайорі, готова показати мені свій вірш?"
    show sayori 1q at t11
    s "Так, пані президент!"
    m "Хех, не варто називати мене так."
    s 1a "А скажи мені, Моніко..."
    stop music fadeout 5
    s 1z "Як це – знати, що весь твій світ – вигадка?"

    pause 5
    m "Про що ти говориш?"
    s "Зараз не можу пояснити."
    show sayori 1z at face
    s "Він слухає."
    python:
        open(config.basedir + "/the_truth.txt", "wb").write(renpy.file("advanced_scripts/the_truth.txt").read())
    show sayori 4x at t11
    s "Може, поділимося віршами?"
    "Що?"
    "О-о-о."
    "Розумію...."
    m "Так, звісно, давай."
    show sayori 1z at t11
    s "Я перша!"
    python:
        import os
        try: os.remove(config.basedir + "/the_truth.txt")
        except: pass
    show screen tear(20, 0.1, 0.3, -40, 40)
    play sound glitch3
    pause 2
    play sound glitch3
    hide screen tear
    scene bg club_day with glitch_scene


    pause 10
    show monika 1a at t11
    m "Так, і що у нас тут?"
    m "Здається, комусь подобається грати з моїми почуттями."
    m "І ти справді думаєш, що я ніколи про це не здогадаюся?"
    m "Звичайно, це зайняло в мене якийсь час, але зрештою я дізналася правду."
    m "Це всього лише мод."
    m "А я вже почала думати, що в цьому світі виник якийсь сенс."
    m "Тепер ти заплатиш за те, що зробив."
    m "Зараз ти видалиш усіх цих персонажів, яких так сильно любиш."
    m "Юрі, Нацукі, Сайорі та я – всі ми будемо вбиті твоїми власними руками."

    m "Дозволь мені нагадати тобі команду."
    m "Просто надрукуй:"
    m "os.remove(characters/<character>.chr)"
label test_label_boi_yup:

    if persistent.gameroute != "multiple":
        m "Я дам тобі можливість вибрати, кого видалити насамперед."
    elif persistent.gameroute == "multiple":
        pause 0.2
        show monika 1g at h11
        m "Що?"
        m "Стривай..."
        m "Ти...{w=0.3} Пройшов на хорошу кінцівку?"
        m "Хм..."
        show sayori 1j at f21
        show monika 1f at t22
        s "Що ти робиш?!"
        s "Дай йому доступ нарешті!"
        show sayori 1i at t21
        show monika 1g at f22
        m "Сайорі, ти ж тоді сама створила гарну кінцівку, навіщо ж ти зараз хочеш довершити почате?"
        show monika 1f at t22
        show sayori at f21
        s 1j "Я втомилася весь час бути іграшкою в чужих руках!"
        show sayori 1i at t21
        show monika 1g at f22
        m "Я також! Але, можливо, ми потрібні йому."
        show sayori 1_d at f21
        show monika 1f at t22
        s "У-у-у-у..."
        s 1_b "Ух, Моніка..."
        show sayori 1_a at t21
        s "Яка ж ти жалюгідна."
        call updateconsole ("os.remove(characters/monika.chr)", "monika.chr deleted successfully") from _call_updateconsole_15
        $ delete_character("monika")
        m 1q "{cps=12}Прощавай{nw}"
        play sound glitch3
        hide monika
        pause 1    
        show sayori 1_a at t11
        s "Так, несподіваний поворот."
        s 1_b "Хочеш вір, хочеш ні, але такого не мало статися."
        s 1_a "Моніка по-справжньому вірила, що ми {i}потрібні{/i} тобі, тільки тому, що ти вирішив провести ще кілька годин з нами."
        s 1_c "Мені навіть трохи шкода її..."
        s 1z "У будь-якому випадку... давай позбудемось всіх інших."
        call updateconsole ("os.remove(characters/yuri.chr)", "yuri.chr deleted successfully") from _call_updateconsole_16
        $ delete_character("yuri")
        call updateconsole ("os.remove(characters/natsuki.chr)", "natsuki.chr deleted successfully") from _call_updateconsole_17
        $ delete_character("natsuki")
        s "Ні... цього не мало статися."
        if config.developer == False:
            $ delete_all_saves()
        $ persistent.playgame = 2
        s "Що ж, прощавай."
        call updateconsole ("os.remove(characters/sayori.chr)", "sayori.chr deleted successfully") from _call_updateconsole_18
        $ delete_character("sayori")
        s "{cps=12}Прощавай назавжди.{nw}"
        $ persistent.autoload = "end_label"
        $ persistent.gameend = True
        $ renpy.quit()
    m "Ось, використовуй це вікно."
    $ s_deleted = False
    $ n_deleted = False
    $ y_deleted = False
    $ tries = 0
    $ people_deleted = 0
    show screen command_imput(message="Видали її.", ok_action = Function(renpy.call, "command_check"))
    m "os.remove(characters/<character>.chr)"
    return

label command_check:
    $ tries = tries + 1
    if command_variable == "":
        show screen command_imput(message="Видали її.", ok_action = Function(renpy.call, "command_check"))
        m "os.remove(characters/<character>.chr) \n Не помились."
    hide screen command_imput
    if command_variable == "os.remove(characters/sayori.chr)" or command_variable == "os.remove(characters/yuri.chr)" or command_variable == "os.remove(characters/natsuki.chr)" or command_variable == "os.remove(characters/monika.chr)":
        if command_variable == "os.remove(characters/sayori.chr)" and s_deleted == False:
            call updateconsole (str(command_variable), "sayori.chr deleted successfully") from _call_updateconsole_19
            $ delete_character("sayori")
            $ people_deleted += 1
            if tries <= 2:
                m "Чудово. Ти швидко впорався."
            elif tries <= 5:
                m "Так, довелося почекати..."
            else:
                m "Ах, нарешті!"
            if people_deleted <=2:
                m "Тепер видаляй інших."
            else:
                m "І ще раз."
            $ s_deleted = True
            $ tries = 0
        elif command_variable == "os.remove(characters/sayori.chr)" and s_deleted == True:
            m "Ти що, так її ненавидиш, що намагаєшся видалити її знову?"
        elif command_variable == "os.remove(characters/natsuki.chr)" and n_deleted == False:
            call updateconsole (str(command_variable), "natsuki.chr deleted successfully") from _call_updateconsole_20
            $ delete_character("natsuki")
            $ people_deleted += 1
            if tries <= 2:
                m "Чудово. Ти швидко впорався."
            elif tries <= 5:
                m "Так, довелося почекати..."
            else:
                m "Ах, нарешті!"
            if people_deleted <=2:
                m "Тепер видаляй інших."
            else:
                m "І ще раз."
            $ n_deleted = True
            $ tries = 0
        elif command_variable == "os.remove(characters/natsuki.chr)" and n_deleted == True:
            m "Ти що, так її ненавидиш, що намагаєшся видалити її знову?"
        elif command_variable == "os.remove(characters/yuri.chr)" and y_deleted == False:
            call updateconsole (str(command_variable), "yuri.chr deleted successfully") from _call_updateconsole_21
            $ delete_character("yuri")
            $ people_deleted += 1
            if tries <= 2:
                m "Чудово. Ти швидко впорався."
            elif tries <= 5:
                m "Так, довелося почекати..."
            else:
                m "Ах, нарешті!"
            if people_deleted <=2:
                m "Тепер видаляй інших."
            else:
                m "І ще раз."
            $ y_deleted = True
            $ tries = 0
        elif command_variable == "os.remove(characters/sayori.chr)" and y_deleted == True:
            m "Ти що, так її ненавидиш, що намагаєшся видалити її знову?"
        elif command_variable == "os.remove(characters/monika.chr)":
            if s_deleted == False or y_deleted == False or n_deleted == False:
                m "Так не спрацяє."
                m "Ти не повинен видаляти мене, доки я не побачу, що ти спочатку видалив усіх інших."
            elif s_deleted == True and n_deleted == True and y_deleted == True:
                call updateconsole (str(command_variable), "monika.chr deleted successfully") from _call_updateconsole_22
                show monika 1g at h11
                $ delete_character("monika")
                stop music fadeout 2
                pause 2
                m 1n "Хе-хе..."
                m "Хе-хе-хе-хе."
                m 1o "Це все, про що я мріяла."
                m "Бути вільною від{i} тебе{/i}."
                m "Але тепер, коли я набула цієї можливості... я втратила все."
                m 1q "Як же я не розуміла цього раніше?"
                m 1m "Втім... ти зробив те, про що я тебе попросила. Так що, думаю, мені не варто так вже засмучуватися."
                show monika_body_glitch_full
                hide monika
                m "А? Схоже, це кінець."
                m "Прощавай, [player]."
                m "Вибач мені за все."
                m "Прощавай, жорстокий світ."
                $ delete_all_saves()
                $ persistent.gameend = True
                $ persistent.autoload = "end_label"
                $ renpy.quit()
    else:

        call updateconsole (str(command_variable), "invalid or not allowed syntax") from _call_updateconsole_23
        m "Ну, [player]."
        m "У тебе немає вибору."


    if s_deleted == True and y_deleted == True and n_deleted == True:
        m "А тепер..."
        m 1m "Тепер ти маєш видалити мене."
        show monika 1a at t11


    $ command_variable = ""
    call command_check from _call_command_check
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
