init python:
    class Poem:
        def __init__(self, author="", title="", text="", yuri_2=False, yuri_3=False):
            self.author = author
            self.title = title
            self.text = text
            self.yuri_2 = yuri_2
            self.yuri_3 = yuri_3    

    poem_player = Poem(
    author = "player",
    title = "Втрачене кохання",
    text = """\
Я шукаю причину рухатись вперед.
Я шукаю причину продовжити старатись.
Я шукаю причину тебе не відпускать.
Я шукаю причину іти і не здаватись.\n
Цією причиною стала ти.\n
Ось чому я хочу рухатись вперед.
Ось чому я хочу сильніше старатись.
Ось чому я не хочу здаватись.
Ти — причина моя.\n
Але тепер ти пішла.
Кудись в далекі краї.
Не залишилось у мене нічого.\n
Нема причини рухатись вперед.
Нема причини продовжувати намагатись.
Нема причини іти і не здаватись.
Я втратив все, коли пішла ти.
Нема у мене причини ні на що.\n
Ти була причиною моєю.
Ти була любов’ю моєю.
Ти була реальністю моєю.
Тепер ти для мене все, но я для тебе — ніщо. \n\n\n
Прошу, повернись. """
    )

    poem_y2_yeet = Poem(
    author = "yuri",
    title = "Єнот",
    text = """\
Це сталося посеред ночі, саме тоді, коли, я винувато... \
Хліб для нічного перекусу нарізала.
Мою увагу привернув єнот, що нишпорив поза моїм вікном назовні.
Це був, я впевнена, найперший раз коли я дивні нахили свої пізнала. 
Єноту я дала шматочок хліба, не дивлячись на те що підсвідомість вже добре розуміла всі наслідки цієї дії.
Вже добре розуміла, що підгодований єнот почне все більше й більше вимагати.
Приваблива краса ножа була симптомом.
Хліб - був голодною цікавістю моєю.
Єнот - бажанням.

Чим більше фаза Місяця тим більше відбиває світла гостре лезо.
Так схожого на світло що блищить в очах мого товариша-єнота.
Я нарізаю хліб, він свіжий та м’який.
Це збуджує єнота.
Або, що є цілком можливо, я просто проектую емоції свої на тільки-но вдоволену тварину.

Єнот тепер постійно слідує за мною.
Сказати можна - звикли бути разом. Єнот стає голодним все частіше,
Тому я хліб завжди тримаю під рукою.
Коли я змахую ножем, кожного разу, Єнот мій збудження своє знов буде проявляти.
Крові прилив. Класичний Павлова рефлекс. Я нарізаю хліб. 
Продовжу себе годувати."""
    )

    poem_n2_yeet = Poem(
    author = "natsuki",
    title = "Емі любить павуків",
    text = """\
Знаєш, що я чула про Емі?
Емі любить павуків.
Волохатих, потворних, мерзенних павуків що звиваються!
Ось чому я не подруга їй.

Голос Емі милий, співучий.
Я чула, як вона співала мою улюблену пісню про кохання.
Коли вона співала в хорі, в ритмі слів билося моє серце.
Але вона любить павуків.
Ось чому я не подруга їй.

Якось я підвернула ногу.
Емі допомогла мені підвестися і відвела мене до медсестри.
Я намагалася не дати їй торкнутись мене всю дорогу.
Вона любить павуків, тому її руки, можливо, бридкі.
Ось чому я не подруга їй.

У Емі друзів дуже багато.
Постійно бачу як вона розмовляє з людьми.
Можливо, вона говорить про павуків.
Що якщо її друзі теж почнуть їх любити?
Ось чому я не подруга їй.

Не важливо, чи є в неї інші хобі.
Не важливо, якщо вона це нікому не показує.
Не важливо, якщо це нікому не шкодить."""
    )
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
